package homework2;
public class homework2 {
    public static void main(String[] args) {
        // Домашка
        // Базовый уровень
        // Задание №1 - Написать цикл, который выводит через пробел 100 чисел с приставкой "a".
        // Ожидаемый результат: 1а 2а 3а .. 100а
        int x = 1;
        while( x < 101 ) {
            System.out.print(x+ "a " );
            x++;
            }

    }
}