package homework2;

public class homework2_2 {
    public static void main(String[] args) {
        // Задание №2
        // Дано:
        int ageChildren = 10;
        // Задача: Написать условную конструкцию, которая в зависимости от возраста ребенка, отправляет его в учебное заведение
        // если ребенку до 6 лет то в сад, если до 11 лет в младшую школу, если до 17 лет в среднюю школу, иначе в университет
        // Отправляет - имеется в виду, печатает на экран: "пошел с сад", "пошел в младшую школу" и т.д.
        // Проверьте работоспособность условий, через изменение значения переменной.
//        int educationAge1 = 6;
      int educationAge2 = 10;
//      int educationAge3 = 17;
  //      if (ageChildren >= educationAge1) {
      if (ageChildren <= educationAge2){
//      if (ageChildren <= educationAge3){
//          System.out.println("пошел в сад");
          System.out.println("пошел в младшую школу");
//          System.out.println("пошел в младшую школу");
//          System.out.println("пошел в среднюю школу");
//          System.out.println("пошел в университет");

        }
    }
}
