package lesson1;

public class homework1_2 {
    //Задача №2
    //Создать переменные с ростом, весом.
    //Произвести расчет индекса массы тела (вес) / (рост * рост) используя переменные, вывести на экран
    //Пример результата вывода на экран:
    //21.0
    public static void main(String[] args) {
        double a = 70.0;
        double b = 1.8;
        double x = a/(b*b);
        System.out.println(x);;
    }
}
